package com.aier.cloud.biz.service.biz.amcs.idr.enums;

import com.aier.cloud.basic.common.convert.EnumDict;

/**
 * 职业编码
 *
 * @author Luorz
 * @since 2023年5月09日 下午3:09:04
 */
public enum OccupationcodeEnum implements EnumDict<OccupationcodeEnum> {
	K1100("1100","A国家机关、党群组织、企业、事业单位负责人"),
	K1101("1101","1中国共产党中央委员会和地方各级党组织负责人"),
	K1102("1102","2国家机关及其工作机构负责人"),
	K1103("1103","3民主党派和社会团体及其工作机构负责人"),
	K1104("1104","4事业单位负责人"),
	K1105("1105","5企业负责人"),
	K1200("1200","B专业技术人员"),
	K1201("1201","11科学研究人员"),
	K1202("1202","13工程技术人员"),
	K1203("1203","17农业技术人员"),
	K1204("1204","18飞机和船舶技术人员"),
	K1205("1205","19卫生专业技术人员"),
	K1206("1206","21经济业务人员"),
	K1207("1207","22金融业务人员"),
	K1208("1208","23法律专业人员"),
	K1209("1209","24教学人员"),
	K1210("1210","25文学艺术工作人员"),
	K1211("1211","26体育工作人员"),
	K1212("1212","27新闻出版、文化工作人员"),
	K1213("1213","28宗教职业者"),
	K1214("1214","29其他专业技术人员"),
	K1300("1300","C办事人员和有关人员"),
	K1301("1301","31行政办公人员"),
	K1302("1302","32安全保卫和消防人员"),
	K1303("1303","33邮政和电信业务人员"),
	K1304("1304","39其他办事人员和有关人员"),
	K1400("1400","D商业、服务业人员"),
	K1401("1401","41购销人员"),
	K1402("1402","42仓储人员"),
	K1403("1403","43餐饮服务人员"),
	K1404("1404","44饭店、旅游及健身娱乐场所服务人员"),
	K1405("1405","45运输服务人员"),
	K1406("1406","46医疗卫生辅助服务人员"),
	K1407("1407","47社会服务和居民生活服务人员"),
	K1408("1408","49其他商业、服务业人员"),
	K1500("1500","E农、林、牧、渔、水利业生产人员"),
	K1501("1501","51种植业生产人员"),
	K1502("1502","52林业生产及野生动植物保护人员"),
	K1503("1503","53畜牧业生产人员"),
	K1504("1504","54渔业生产人员"),
	K1505("1505","55水利设施管理养护人员"),
	K1506("1506","59其他农、林、牧、渔、水利业生产人员"),
	K1600("1600","F生产、运输设备操作人员及有关人员"),
	K1601("1601","61勘测及矿物开采人员"),
	K1602("1602","62金属冶炼、轧制人员"),
	K1603("1603","64化工产品生产人员"),
	K1604("1604","66机械制造加工人员"),
	K1605("1605","67机电产品装配人员"),
	K1606("1606","71机械设备修理人员"),
	K1607("1607","72电力设备安装、运行、检修及供电人员"),
	K1608("1608","73电子元器件与设备制造、装配调试及维修人员"),
	K1609("1609","74橡胶和塑料制品生产人员"),
	K1610("1610","75纺织、针织、印染人员"),
	K1611("1611","76裁剪缝纫和皮革、毛皮制品加工制作人员"),
	K1612("1612","77粮油、食品、饮料生产加工及饲料生产加工人员"),
	K1613("1613","78烟草及其制品加工人员"),
	K1614("1614","79药品生产人员"),
	K1615("1615","81木材加工、人造板生产及木材制品制作人员、制浆、造纸和纸制品生"),
	K1616("1616","82建筑材料生产加工人员"),
	K1617("1617","83玻璃、陶瓷、搪瓷及其制品生产加工人员"),
	K1618("1618","84广播影视制品制作、播放及文物保护作业人员"),
	K1619("1619","85印刷人员"),
	K1620("1620","86工艺、美术品制作人员"),
	K1621("1621","87文化教育、体育用品制作人员"),
	K1622("1622","88工程施工人员"),
	K1623("1623","91运输设备操作人员及有关人员"),
	K1624("1624","92环境监测与废物处理人员"),
	K1625("1625","93检验、计量人员"),
	K1626("1626","99其他生产、运输设备操作人员及有关人员"),
	K1700("1700","G军人"),
	K1800("1800","H不便分类的其他从业人员"),
	K1900("1900","I婴幼儿、学龄前儿童"),
	K2000("2000","J学生"),
	K2100("2100","K家务"),
	K2200("2200","L无业或待业") ;

    private String code;
    private String value;

    private OccupationcodeEnum(String code, String value){
        this.code = code;
        this.value = value;
    }

    @Override
    public String getEnumCode() {
        return code;
    }

    @Override
    public String getEnumDesc() {
        return value;
    }



    public static boolean isInclude(String key){
        boolean include = false;
        for (OccupationcodeEnum e: OccupationcodeEnum.values()){
            if(e.name().equals(key)){
                include = true;
                break;
            }
        }
        return include;
    }
}
